In [1]:
# Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_url = "https://query.data.world/s/rut5pr5nm5i4onzlfp6xjgcsw3rvu4"
df_raw = pd.read_csv(data_url)

In [3]:
df_raw.sample(5)

,category,city,company_name,geo,job_board,job_description,job_requirements,job_title,job_type,post_date,salary_offered,state
30255,motoring automotive jobs,Hull,Northgate,uk,reed,Apply on employer's website Northgate vehicle...,NaN,Driver / Valeter,"Permanent, full-time",3/7/2018,£7.50 per hour,North Humberside
30688,marketing jobs,Chard,Office Angels,uk,reed,"Apply now Are you ambitious, highly motivated...",NaN,Marketing Executive,"Permanent, full-time",3/7/2018,"£18,000 - £25,000 per annum",Somerset
41137,accountancy jobs,South West London,Hays Specialist Recruitment Limited,uk,reed,Apply now Audit and Accounts Payable Officer ...,NaN,Audit and Accounts Payable Officer Job,"Temporary, full-time",2/27/2018,£130.00 - £170.00 per day,London
30062,motoring automotive jobs,St. Neots,Auto Talent,uk,reed,Apply now Due to ever increasing levels of bu...,Required skills vehicle technician mechanic d...,Vehicle Technician,"Permanent, full-time",2/27/2018,"£25,000 - £33,000 per annum",Cambridgeshire
46680,purchasing jobs,Peterborough,Reed,uk,reed,Apply now Do you possess a high degree of pro...,NaN,Supplier Liaison Assistant,"Temporary, full-time",3/5/2018,£8.89 per hour,Cambridgeshire

In [4]:
df_raw.dtypes

category            object
city                object
company_name        object
geo                 object
job_board           object
job_description     object
job_requirements    object
job_title           object
job_type            object
post_date           object
salary_offered      object
state               object
dtype: object

In [5]:
df_raw.isnull().sum()

category                0
city                    0
company_name            0
geo                     0
job_board               0
job_description         0
job_requirements    29452
job_title               0
job_type                0
post_date               0
salary_offered          0
state                  20
dtype: int64

In [6]:
df_raw.shape

(50000, 12)

In [7]:
df_raw.describe()

,category,city,company_name,geo,job_board,job_description,job_requirements,job_title,job_type,post_date,salary_offered,state
count,50000,50000,50000,50000,50000,50000,20548,50000,50000,50000,50000,49980
unique,37,2918,5166,1,1,42057,14887,29155,9,66,7345,167
top,health jobs,London,Hays Specialist Recruitment Limited,uk,reed,Apply on employer's website Add an annual tur...,Required skills Recruitment,Administrator,"Permanent, full-time",3/7/2018,Salary negotiable,London
freq,1930,4349,1830,50000,50000,85,123,162,36864,8472,4539,5900

In [28]:
list(df_raw["job_requirements"].sample(5))

[nan,
 nan,
 ' Required skills MRP Production Planning Supply Chain ',
 nan,
 ' Required skills Business Development Client Meetings Negotiating Sales Candidate Generation ']

In [47]:
df_raw.groupby("state")["city","company_name"].count()

<ipython-input-47-fde8f5888301>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df_raw.groupby("state")["city","company_name"].count()

                          city  company_name
state
Aberdeen                     3             3
Aberdeenshire              187           187
Abu Dhabi                   19            19
Afghanistan                  2             2
Angus                       78            78
...                        ...           ...
Wigtownshire                 3             3
Wiltshire                  579           579
Worcestershire             322           322
Wrexham                      2             2
Yorkshire and Humberside   162           162

[167 rows x 2 columns]